amazons3-connector-test/src/resources/artifacts/ESB/config/soapRequests/amazons3/getBucketRequestPayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.amazons3.getbucketrequestpayment">
   <soapenv:Header/>
   <soapenv:Body>
            <urn:accessKeyId>AKIAJ5H4DUFA3O2VJMLA</urn:accessKeyId>
            <urn:bucketName>fancyBucket</urn:bucketName>
            <urn:secretAccessKey>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</urn:secretAccessKey>
            <urn:methodType>GET</urn:methodType>
            <urn:contentLength></urn:contentLength>
            <urn:contentType>application/xml</urn:contentType>
            <urn:contentMD5></urn:contentMD5>
            <urn:expect></urn:expect>
            <urn:host>s3.amazonaws.com</urn:host>
            <urn:xAmzDate>true</urn:xAmzDate>
            <urn:xAmzSecurityToken></urn:xAmzSecurityToken>
            <urn:bucketUrl>http://s3.amazonaws.com/fancyBucket</urn:bucketUrl>
            <urn:uriRemainder>?requestPayment</urn:uriRemainder>   
   </soapenv:Body>
</soapenv:Envelope>